It doesn't seem to work in my environment:
* Step 1
```
> terraform state rm random_id.fernet_key

Removed random_id.fernet_key
Successfully removed 1 resource instance(s).

> terraform import random_id.fernet_key <REDACTED>

Import successful!

The resources that were imported are shown above. These resources are now in
your Terraform state and will henceforth be managed by Terraform.
```
* Step 2
```
> terraform init
- Installing hashicorp/random v3.6.1...
- Installed hashicorp/random v3.6.1 (verified checksum)

> terraform plan
random_id.fernet_key: Refreshing state... [id=<REDACTED>]

  # random_id.fernet_key must be replaced
-/+ resource "random_id" "fernet_key" {
      ~ b64_std     = "<REDACTED>" -> (known after apply)
      ~ b64_url     = "<REDACTED>" -> (known after apply)
      ~ dec         = "<REDACTED>" -> (known after apply)
      ~ hex         = "<REDACTED>" -> (known after apply)
      ~ id          = "<REDACTED>" -> (known after apply)
      + keepers     = { # forces replacement
          + "name" = "demo-secret-key"
        }
        # (1 unchanged attribute hidden)
    }
```